7767517
227 256
Input                    in0                      0 1 in0
Clip                     clamp_168                1 1 in0 1 0=0.000000e+00 1=1.638300e+04
Embed                    embed_0                  1 1 1 2 0=256 1=16384 2=0 3=4194304
Reshape                  view_159                 1 1 2 3 0=256 1=16 2=-1
Permute                  permute_170              1 1 3 4 0=4
Convolution              conv_79                  1 1 4 5 0=256 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=65536
Convolution              conv_80                  1 1 5 6 0=512 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=1179648
Split                    splitncnn_0              1 2 6 7 8
GroupNorm                gn_1                     1 1 8 9 0=32 1=512 2=1.000000e-05 3=1
Swish                    silu_36                  1 1 9 10
Convolution              conv_81                  1 1 10 11 0=512 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=2359296
GroupNorm                gn_2                     1 1 11 12 0=32 1=512 2=1.000000e-05 3=1
Swish                    silu_37                  1 1 12 13
Convolution              conv_82                  1 1 13 14 0=512 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=2359296
BinaryOp                 add_0                    2 1 7 14 15 0=0
Split                    splitncnn_1              1 2 15 16 17
GroupNorm                gn_138                   1 1 17 18 0=32 1=512 2=1.000000e-05 3=1
Split                    splitncnn_2              1 3 18 19 20 21
Convolution              conv_83                  1 1 21 22 0=512 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=262144
Convolution              conv_84                  1 1 20 23 0=512 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=262144
Reshape                  reshape_143              1 1 22 24 0=-1 1=512
Reshape                  reshape_144              1 1 23 25 0=-1 1=512
Permute                  permute_171              1 1 24 26 0=1
MatMul                   bmm_160                  2 1 26 25 27
BinaryOp                 div_1                    1 1 27 28 0=3 1=1 2=2.262742e+01
Convolution              conv_85                  1 1 19 29 0=512 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=262144
Softmax                  softmax_71               1 1 28 30 0=1 1=1
Reshape                  reshape_145              1 1 29 31 0=-1 1=512
MatMul                   matmultransb_0           2 1 31 30 32 0=1
Reshape                  reshape_146              1 1 32 33 0=-1 1=16 2=512
Convolution              conv_86                  1 1 33 34 0=512 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=262144
BinaryOp                 add_2                    2 1 16 34 35 0=0
Split                    splitncnn_3              1 2 35 36 37
GroupNorm                gn_3                     1 1 37 38 0=32 1=512 2=1.000000e-05 3=1
Swish                    silu_38                  1 1 38 39
Convolution              conv_87                  1 1 39 40 0=512 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=2359296
GroupNorm                gn_4                     1 1 40 41 0=32 1=512 2=1.000000e-05 3=1
Swish                    silu_39                  1 1 41 42
Convolution              conv_88                  1 1 42 43 0=512 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=2359296
BinaryOp                 add_3                    2 1 36 43 44 0=0
Split                    splitncnn_4              1 2 44 45 46
GroupNorm                gn_5                     1 1 46 47 0=32 1=512 2=1.000000e-05 3=1
Swish                    silu_40                  1 1 47 48
Convolution              conv_89                  1 1 48 49 0=512 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=2359296
GroupNorm                gn_6                     1 1 49 50 0=32 1=512 2=1.000000e-05 3=1
Swish                    silu_41                  1 1 50 51
Convolution              conv_90                  1 1 51 52 0=512 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=2359296
BinaryOp                 add_4                    2 1 45 52 53 0=0
Split                    splitncnn_5              1 2 53 54 55
GroupNorm                gn_139                   1 1 55 56 0=32 1=512 2=1.000000e-05 3=1
Split                    splitncnn_6              1 3 56 57 58 59
Convolution              conv_91                  1 1 59 60 0=512 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=262144
Convolution              conv_92                  1 1 58 61 0=512 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=262144
Reshape                  reshape_147              1 1 60 62 0=-1 1=512
Reshape                  reshape_148              1 1 61 63 0=-1 1=512
Permute                  permute_173              1 1 62 64 0=1
MatMul                   bmm_162                  2 1 64 63 65
BinaryOp                 div_5                    1 1 65 66 0=3 1=1 2=2.262742e+01
Convolution              conv_93                  1 1 57 67 0=512 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=262144
Softmax                  softmax_72               1 1 66 68 0=1 1=1
Reshape                  reshape_149              1 1 67 69 0=-1 1=512
MatMul                   matmultransb_1           2 1 69 68 70 0=1
Reshape                  reshape_150              1 1 70 71 0=-1 1=16 2=512
Convolution              conv_94                  1 1 71 72 0=512 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=262144
BinaryOp                 add_6                    2 1 54 72 73 0=0
Split                    splitncnn_7              1 2 73 74 75
GroupNorm                gn_7                     1 1 75 76 0=32 1=512 2=1.000000e-05 3=1
Swish                    silu_42                  1 1 76 77
Convolution              conv_95                  1 1 77 78 0=512 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=2359296
GroupNorm                gn_8                     1 1 78 79 0=32 1=512 2=1.000000e-05 3=1
Swish                    silu_43                  1 1 79 80
Convolution              conv_96                  1 1 80 81 0=512 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=2359296
BinaryOp                 add_7                    2 1 74 81 82 0=0
Split                    splitncnn_8              1 2 82 83 84
GroupNorm                gn_140                   1 1 84 85 0=32 1=512 2=1.000000e-05 3=1
Split                    splitncnn_9              1 3 85 86 87 88
Convolution              conv_97                  1 1 88 89 0=512 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=262144
Convolution              conv_98                  1 1 87 90 0=512 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=262144
Reshape                  reshape_151              1 1 89 91 0=-1 1=512
Reshape                  reshape_152              1 1 90 92 0=-1 1=512
Permute                  permute_175              1 1 91 93 0=1
MatMul                   bmm_164                  2 1 93 92 94
BinaryOp                 div_8                    1 1 94 95 0=3 1=1 2=2.262742e+01
Convolution              conv_99                  1 1 86 96 0=512 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=262144
Softmax                  softmax_73               1 1 95 97 0=1 1=1
Reshape                  reshape_153              1 1 96 98 0=-1 1=512
MatMul                   matmultransb_2           2 1 98 97 99 0=1
Reshape                  reshape_154              1 1 99 100 0=-1 1=16 2=512
Convolution              conv_100                 1 1 100 101 0=512 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=262144
BinaryOp                 add_9                    2 1 83 101 102 0=0
Split                    splitncnn_10             1 2 102 103 104
GroupNorm                gn_9                     1 1 104 105 0=32 1=512 2=1.000000e-05 3=1
Swish                    silu_44                  1 1 105 106
Convolution              conv_101                 1 1 106 107 0=512 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=2359296
GroupNorm                gn_10                    1 1 107 108 0=32 1=512 2=1.000000e-05 3=1
Swish                    silu_45                  1 1 108 109
Convolution              conv_102                 1 1 109 110 0=512 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=2359296
BinaryOp                 add_10                   2 1 103 110 111 0=0
Split                    splitncnn_11             1 2 111 112 113
GroupNorm                gn_141                   1 1 113 114 0=32 1=512 2=1.000000e-05 3=1
Split                    splitncnn_12             1 3 114 115 116 117
Convolution              conv_103                 1 1 117 118 0=512 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=262144
Convolution              conv_104                 1 1 116 119 0=512 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=262144
Reshape                  reshape_155              1 1 118 120 0=-1 1=512
Reshape                  reshape_156              1 1 119 121 0=-1 1=512
Permute                  permute_177              1 1 120 122 0=1
MatMul                   bmm_166                  2 1 122 121 123
BinaryOp                 div_11                   1 1 123 124 0=3 1=1 2=2.262742e+01
Convolution              conv_105                 1 1 115 125 0=512 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=262144
Softmax                  softmax_74               1 1 124 126 0=1 1=1
Reshape                  reshape_157              1 1 125 127 0=-1 1=512
MatMul                   matmultransb_3           2 1 127 126 128 0=1
Reshape                  reshape_158              1 1 128 129 0=-1 1=16 2=512
Convolution              conv_106                 1 1 129 130 0=512 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=262144
BinaryOp                 add_12                   2 1 112 130 131 0=0
Interp                   upsample_nearest_75      1 1 131 132 0=1 1=2.000000e+00 2=2.000000e+00 6=0
Convolution              conv_107                 1 1 132 133 0=512 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=2359296
Split                    splitncnn_13             1 2 133 134 135
GroupNorm                gn_11                    1 1 134 136 0=32 1=512 2=1.000000e-05 3=1
Swish                    silu_46                  1 1 136 137
Convolution              conv_108                 1 1 137 138 0=256 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=1179648
GroupNorm                gn_12                    1 1 138 139 0=32 1=256 2=1.000000e-05 3=1
Swish                    silu_47                  1 1 139 140
Convolution              conv_110                 1 1 135 141 0=256 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=131072
Convolution              conv_109                 1 1 140 142 0=256 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=589824
BinaryOp                 add_13                   2 1 141 142 143 0=0
Split                    splitncnn_14             1 2 143 144 145
GroupNorm                gn_13                    1 1 145 146 0=32 1=256 2=1.000000e-05 3=1
Swish                    silu_48                  1 1 146 147
Convolution              conv_111                 1 1 147 148 0=256 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=589824
GroupNorm                gn_14                    1 1 148 149 0=32 1=256 2=1.000000e-05 3=1
Swish                    silu_49                  1 1 149 150
Convolution              conv_112                 1 1 150 151 0=256 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=589824
BinaryOp                 add_14                   2 1 144 151 152 0=0
Split                    splitncnn_15             1 2 152 153 154
GroupNorm                gn_15                    1 1 154 155 0=32 1=256 2=1.000000e-05 3=1
Swish                    silu_50                  1 1 155 156
Convolution              conv_113                 1 1 156 157 0=256 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=589824
GroupNorm                gn_16                    1 1 157 158 0=32 1=256 2=1.000000e-05 3=1
Swish                    silu_51                  1 1 158 159
Convolution              conv_114                 1 1 159 160 0=256 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=589824
BinaryOp                 add_15                   2 1 153 160 161 0=0
Interp                   upsample_nearest_76      1 1 161 162 0=1 1=2.000000e+00 2=2.000000e+00 6=0
Convolution              conv_115                 1 1 162 163 0=256 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=589824
Split                    splitncnn_16             1 2 163 164 165
GroupNorm                gn_17                    1 1 165 166 0=32 1=256 2=1.000000e-05 3=1
Swish                    silu_52                  1 1 166 167
Convolution              conv_116                 1 1 167 168 0=256 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=589824
GroupNorm                gn_18                    1 1 168 169 0=32 1=256 2=1.000000e-05 3=1
Swish                    silu_53                  1 1 169 170
Convolution              conv_117                 1 1 170 171 0=256 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=589824
BinaryOp                 add_16                   2 1 164 171 172 0=0
Split                    splitncnn_17             1 2 172 173 174
GroupNorm                gn_19                    1 1 174 175 0=32 1=256 2=1.000000e-05 3=1
Swish                    silu_54                  1 1 175 176
Convolution              conv_118                 1 1 176 177 0=256 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=589824
GroupNorm                gn_20                    1 1 177 178 0=32 1=256 2=1.000000e-05 3=1
Swish                    silu_55                  1 1 178 179
Convolution              conv_119                 1 1 179 180 0=256 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=589824
BinaryOp                 add_17                   2 1 173 180 181 0=0
Split                    splitncnn_18             1 2 181 182 183
GroupNorm                gn_21                    1 1 183 184 0=32 1=256 2=1.000000e-05 3=1
Swish                    silu_56                  1 1 184 185
Convolution              conv_120                 1 1 185 186 0=256 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=589824
GroupNorm                gn_22                    1 1 186 187 0=32 1=256 2=1.000000e-05 3=1
Swish                    silu_57                  1 1 187 188
Convolution              conv_121                 1 1 188 189 0=256 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=589824
BinaryOp                 add_18                   2 1 182 189 190 0=0
Interp                   upsample_nearest_77      1 1 190 191 0=1 1=2.000000e+00 2=2.000000e+00 6=0
Convolution              conv_122                 1 1 191 192 0=256 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=589824
Split                    splitncnn_19             1 2 192 193 194
GroupNorm                gn_23                    1 1 193 195 0=32 1=256 2=1.000000e-05 3=1
Swish                    silu_58                  1 1 195 196
Convolution              conv_123                 1 1 196 197 0=128 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=294912
GroupNorm                gn_24                    1 1 197 198 0=32 1=128 2=1.000000e-05 3=1
Swish                    silu_59                  1 1 198 199
Convolution              conv_125                 1 1 194 200 0=128 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=32768
Convolution              conv_124                 1 1 199 201 0=128 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=147456
BinaryOp                 add_19                   2 1 200 201 202 0=0
Split                    splitncnn_20             1 2 202 203 204
GroupNorm                gn_25                    1 1 204 205 0=32 1=128 2=1.000000e-05 3=1
Swish                    silu_60                  1 1 205 206
Convolution              conv_126                 1 1 206 207 0=128 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=147456
GroupNorm                gn_26                    1 1 207 208 0=32 1=128 2=1.000000e-05 3=1
Swish                    silu_61                  1 1 208 209
Convolution              conv_127                 1 1 209 210 0=128 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=147456
BinaryOp                 add_20                   2 1 203 210 211 0=0
Split                    splitncnn_21             1 2 211 212 213
GroupNorm                gn_27                    1 1 213 214 0=32 1=128 2=1.000000e-05 3=1
Swish                    silu_62                  1 1 214 215
Convolution              conv_128                 1 1 215 216 0=128 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=147456
GroupNorm                gn_28                    1 1 216 217 0=32 1=128 2=1.000000e-05 3=1
Swish                    silu_63                  1 1 217 218
Convolution              conv_129                 1 1 218 219 0=128 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=147456
BinaryOp                 add_21                   2 1 212 219 220 0=0
Interp                   upsample_nearest_78      1 1 220 221 0=1 1=2.000000e+00 2=2.000000e+00 6=0
Convolution              conv_130                 1 1 221 222 0=128 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=147456
Split                    splitncnn_22             1 2 222 223 224
GroupNorm                gn_29                    1 1 224 225 0=32 1=128 2=1.000000e-05 3=1
Swish                    silu_64                  1 1 225 226
Convolution              conv_131                 1 1 226 227 0=128 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=147456
GroupNorm                gn_30                    1 1 227 228 0=32 1=128 2=1.000000e-05 3=1
Swish                    silu_65                  1 1 228 229
Convolution              conv_132                 1 1 229 230 0=128 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=147456
BinaryOp                 add_22                   2 1 223 230 231 0=0
Split                    splitncnn_23             1 2 231 232 233
GroupNorm                gn_31                    1 1 233 234 0=32 1=128 2=1.000000e-05 3=1
Swish                    silu_66                  1 1 234 235
Convolution              conv_133                 1 1 235 236 0=128 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=147456
GroupNorm                gn_32                    1 1 236 237 0=32 1=128 2=1.000000e-05 3=1
Swish                    silu_67                  1 1 237 238
Convolution              conv_134                 1 1 238 239 0=128 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=147456
BinaryOp                 add_23                   2 1 232 239 240 0=0
Split                    splitncnn_24             1 2 240 241 242
GroupNorm                gn_33                    1 1 242 243 0=32 1=128 2=1.000000e-05 3=1
Swish                    silu_68                  1 1 243 244
Convolution              conv_135                 1 1 244 245 0=128 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=147456
GroupNorm                gn_34                    1 1 245 246 0=32 1=128 2=1.000000e-05 3=1
Swish                    silu_69                  1 1 246 247
Convolution              conv_136                 1 1 247 248 0=128 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=147456
BinaryOp                 add_24                   2 1 241 248 249 0=0
GroupNorm                gn_35                    1 1 249 250 0=32 1=128 2=1.000000e-05 3=1
Swish                    silu_70                  1 1 250 251
Convolution              conv_137                 1 1 251 252 0=3 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=3456
Permute                  permute_179              1 1 252 253 0=3
Clip                     clamp_169                1 1 253 254 0=0.000000e+00 1=1.000000e+00
BinaryOp                 mul_25                   1 1 254 out0 0=2 1=1 2=2.550000e+02
